# python HT for lesson 5
"""
1. Напишите программу, которая проверяет, является ли последовательность символов, введенная пользователем, числом.
И если является, определяет тип числа
"""

# n = input()
# try:
#     float(n)
#     if '.' in n:
#         print('float')
#     else:
#         print('int')
# except ValueError:
#     print('string')

"""
2. Напишите программу, которая выводит "Чет", если введенное целое число является четным, и "Нечет" в обратном случае.
"""

# n = int(input())
# if n % 2 == 0:
#     print('Чет')
# else:
#     print('Нечет')

"""
3. Петя ходит в магазин со списком покупок из трех товаров, которые ему нужно купить. Далее он смотрит в каталог и
ищет нужные ему товары. Выведите "YES", если он может найти все нужные товары в каталоге, и "NO" иначе
"""
# sample input :       # sample out:
# One                  # No
# Two
# Three
# One, Three, Four, Five

# B1 = input()
# B2 = input()
# B3 = input()
# listof = input().split(', ')
# if B1 in listof and B2 in listof and B3 in listof:
#     print('YES')
# else:
#     print('NO')

"""
4   Сначала программа получает два произвольных числа, затем одну из двух строк: "+" или "-". Произведите сложение или
вычитание (в этом случае нужно из первого числа вычесть второе) и выведите результат на экран
"""
